//import liraries
import React, { Component } from 'react';
import { View, Text, StyleSheet, FlatList, TouchableOpacity } from 'react-native';
import RNFS from 'react-native-fs';

const mp4s = [
    '张东武太极_01_源流与特点_高清_id19531177.mp4',
    '张东武太极_02_完整演示_高清_id19531177.mp4',
    '张东武太极_03_第一段完整演示_高清_id19531177.mp4',
    '张东武太极_04_第一式：太极起势_高清_id19531177.mp4',
    '张东武太极_05_第二式：金刚捣碓_高清_id19531177.mp4',
    '张东武太极_06_第三式：懒扎衣_高清_id19531177.mp4',
    '张东武太极_07_第四式：六封四闭_高清_id19531177.mp4',
    '张东武太极_08_第五式：单鞭_高清_id19531177.mp4',
    '张东武太极_09_第六式：金刚捣碓_高清_id19531177.mp4',
    '张东武太极_10_第七式：白鹅亮翅_高清_id19531177.mp4',
    '张东武太极_11_第八式：斜行_高清_id19531177.mp4',
    '张东武太极_12_第九式：搂膝_高清_id19531177.mp4',
    '张东武太极_13_第十式：拗步_高清_id19531177.mp4',
    '张东武太极_14_第十一式：斜形_高清_id19531177.mp4',
    '张东武太极_15_第十二式：搂膝_高清_id19531177.mp4',
    '张东武太极_16_第十三式：拗步_高清_id19531177.mp4',
    '张东武太极_17_第十四式：掩手肱拳_高清_id19531177.mp4',
    '张东武太极_18_第十五式：金刚捣碓_高清_id19531177.mp4',
    '张东武太极_19_第一段：跟我一起练_高清_id19531177.mp4',
    '张东武太极_20_第二段完整演示_高清_id19531177.mp4',
    '张东武太极_21_第十六式：撇身拳_高清_id19531177.mp4',
    '张东武太极_22_第十七式：青龙出水_高清_id19531177.mp4',
    '张东武太极_23_第十八式：双推手_高清_id19531177.mp4',
    '张东武太极_24_第十九式：肘底看拳_高清_id19531177.mp4',
    '张东武太极_25_第二十式：倒卷肱_高清_id19531177.mp4',
    '张东武太极_26_第二十一式：白鹅亮翅、二十二式：斜形_高清_id19531177.mp4',
    '张东武太极_27_第二十三式：闪通背_高清_id19531177.mp4',
    '张东武太极_28_第二十四式：掩手肱拳_高清_id19531177.mp4',
    '张东武太极_29_第二十五式：六封四闭、二十六式：单鞭_高清_id19531177.mp4',
    '张东武太极_30_第二十七式：云手_高清_id19531177.mp4',
    '张东武太极_31_第二十八式：高探马_高清_id19531177.mp4',
    '张东武太极_32_第二段：跟我一起练_高清_id19531177.mp4',
    '张东武太极_33_第三段完整演示_高清_id19531177.mp4',
    '张东武太极_34_第二十九式：右擦脚、三十式：左擦脚_高清_id19531177.mp4',
    '张东武太极_35_第三十一式：左蹬一跟_高清_id19531177.mp4',
    '张东武太极_36_第三十二式：前趟拗步_高清_id19531177.mp4',
    '张东武太极_37_第三十三式：击地捶_高清_id19531177.mp4',
    '张东武太极_38_第三十四式：踢二起_高清_id19531177.mp4',
    '张东武太极_39_第三十五式：护心拳_高清_id19531177.mp4',
    '张东武太极_40_第三十六式：旋风脚_高清_id19531177.mp4',
    '张东武太极_41_第三十七式：右蹬一跟_高清_id19531177.mp4',
    '张东武太极_42_第三十八式：掩手肱拳_高清_id19531177.mp4',
    '张东武太极_43_第三段：跟我一起练_高清_id19531177.mp4',
    '张东武太极_44_第四段完整演示_高清_id19531177.mp4',
    '张东武太极_45_第三十九式：小擒打_高清_id19531177.mp4',
    '张东武太极_46_第四十式：抱头推山_高清_id19531177.mp4',
    '张东武太极_47_第四十一式：六封四闭、四十二式：单鞭_高清_id19531177.mp4',
    '张东武太极_48_第四十三式：前招、四十四式：后招_高清_id19531177.mp4',
    '张东武太极_49_第四十五式：野马分鬃_高清_id19531177.mp4',
    '张东武太极_50_第四十六式：六封四闭、四十七式：单鞭_高清_id19531177.mp4',
    '张东武太极_51_第四段：跟我一起练_高清_id19531177.mp4',
    '张东武太极_52_第五段完整演示_高清_id19531177.mp4',
    '张东武太极_53_第四十八式：玉女穿梭_高清_id19531177.mp4',
    '张东武太极_54_第四十九式：懒扎衣_高清_id19531177.mp4',
    '张东武太极_55_第五十式：六封四闭、五十一式：单鞭_高清_id19531177.mp4',
    '张东武太极_56_第五十二式：云手_高清_id19531177.mp4',
    '张东武太极_57_第五十三式：摆莲跌岔_高清_id19531177.mp4',
    '张东武太极_58_第五十四式：金鸡独立_高清_id19531177.mp4',
    '张东武太极_59_第五十五式：倒卷肱_高清_id19531177.mp4',
    '张东武太极_60_第五十六式：白鹅亮翅、五十七式：斜形_高清_id19531177.mp4',
    '张东武太极_61_第五十八式：闪通背_高清_id19531177.mp4',
    '张东武太极_62_第五十九式：掩手肱拳_高清_id19531177.mp4',
    '张东武太极_63_第六十式：六封四闭、六十一式：单鞭_高清_id19531177.mp4',
    '张东武太极_64_第六十二式：云手_高清_id19531177.mp4',
    '张东武太极_65_第六十三式：高探马_高清_id19531177.mp4',
    '张东武太极_66_第五段：跟我一起练_高清_id19531177.mp4',
    '张东武太极_67_第六段完整演示_高清_id19531177.mp4',
    '张东武太极_68_第六十四式：十字脚_高清_id19531177.mp4',
    '张东武太极_69_第六十五式：指裆捶_高清_id19531177.mp4',
    '张东武太极_70_第六十六式：猿猴献果_高清_id19531177.mp4',
    '张东武太极_71_第六十七式：单鞭_高清_id19531177.mp4',
    '张东武太极_72_第六十八式：雀地龙_高清_id19531177.mp4',
    '张东武太极_73_第六十九式：上步七星_高清_id19531177.mp4',
    '张东武太极_74_第七十式：下步跨肱_高清_id19531177.mp4',
    '张东武太极_75_第七十一式：转身双摆莲_高清_id19531177.mp4',
    '张东武太极_76_第七十二式：当头炮_高清_id19531177.mp4',
    '张东武太极_77_第七十三式：金刚捣碓_高清_id19531177.mp4',
    '张东武太极_78_第七十四式：收势_高清_id19531177.mp4',
    '张东武太极_79_第六段：跟我一起练_高清_id19531177.mp4',
    '张东武太极_80_老架一路：跟我一起练_高清_id19531177.mp4'
];
const baseUrl = 'http://ovw1j2fft.bkt.clouddn.com/';
class VideoPlayer extends Component {
    componentDidMount() {

    }
    mPress = (item)=>{
      const { navigation } = this.props;
      navigation.navigate('Video',{url:encodeURI(`${baseUrl}${item}`)});
    }
    render() {
        return (
            <View style={styles.container}>
                <FlatList
                    data={mp4s}
                    renderItem={({item}) => (
                        <TouchableOpacity style={styles.item} onPress={()=>this.mPress(item)}>
                            <Text style={styles.itemText}>
                                {item.replace('张东武太极','').replace('_','').replace('_高清_id19531177.mp4','').replace('_','')}
                            </Text>
                        </TouchableOpacity>
                    )}
                />
            </View>
        );
    }
}

// define your styles
const styles = StyleSheet.create({
    container: {
        flex: 1,
        backgroundColor: 'white',
    },
    item: {
        height: 50,
    },
    itemText: {
        fontSize: 16,
        marginLeft: 15,
        height:50,
        lineHeight: 50,
    }
});

//make this component available to the app
export default VideoPlayer;
